def create_dictionary():
    return {
        "Мельник Андрій Атанасович":{"Hомер справи":"00001", "Дата відкриття справи":"24.11.2024", "Bік":18, "Вага":95, "Зріст":181},
        "Шевченко Тарас Григорович":{"Hомер справи":"00002", "Дата відкриття справи":"18.06.2015", "Bік":25, "Вага":89, "Зріст":164},
        "Кравченко Віктор Андрійович":{"Hомер справи":"00003", "Дата відкриття справи":"15.12.1985", "Bік":54, "Вага":75, "Зріст":176},
        "Іванова Антоніна Миколаївна":{"Hомер справи":"00004", "Дата відкриття справи":"26.04.1986", "Bік":32, "Вага":54, "Зріст":164},
        "Костенко Ліна Василівна":{"Hомер справи":"00005", "Дата відкриття справи":"20.01.2018", "Bік":45, "Вага":61, "Зріст":171}
        }
